{
  "professions": {
    "プログラマー": {
      "id": "programmer",
      "annualIncome": "400万円～1000万円以上",
      "jobDetails": "スマホアプリやゲーム、ウェブサイトなどを作るお仕事です。プログラミングという特別な言葉を使ってコンピューターに指示を出し、みんなが使う便利なシステムや楽しいサービスを生み出します。新しい技術をどんどん学ぶことも大切ですよ。",
      "comment": "あなたはプログラマーに向いているかもしれませんね！パズルを解くみたいに仕組みを考えたり、新しい技術にワクワクしたりするなら、ピッタリです。自分のアイデアを形にして、みんなを驚かせるようなものを作ることに、きっと大きなやりがいを感じるでしょう。まずは簡単なプログラミングから挑戦してみるのも面白いですよ。",
      "traits": [
        "論理的思考が得意で、パズルを解くように問題解決が好き",
        "新しい技術や情報に常にアンテナを張っている",
        "ものづくりや創造的な作業に喜びを感じる",
        "集中して一つの作業に没頭できる",
        "自分のスキルで具体的な成果を出したい"
      ],
      "requiredSkills": [
        "プログラミング言語の習得（Python、JavaScript、Java等）",
        "論理的思考力と問題解決能力",
        "継続的学習への意欲",
        "チームワークとコミュニケーション能力",
        "プロジェクト管理の基礎知識"
      ],
      "careerPath": [
        "新人プログラマー（年収300-500万円）",
        "シニアプログラマー（年収500-800万円）",
        "リードエンジニア・テックリード（年収700-1200万円）",
        "エンジニアリングマネージャー（年収1000万円以上）",
        "CTO・技術責任者（年収1500万円以上）"
      ],
      "workEnvironment": "IT企業、Web系企業、ゲーム会社、フリーランス等。リモートワーク可能な職場が多く、柔軟な働き方ができる環境が増えています。",
      "demandOutlook": "DX推進により需要は急増中。2030年まで慢性的な人手不足が予想され、就職・転職市場では非常に有利な状況が続く見込みです。",
      "relatedProfessions": ["システムエンジニア", "Webデザイナー", "データサイエンティスト", "ITコンサルタント"],
      "educationRequirements": "特定の学歴不要。独学・プログラミングスクール・職業訓練校等で習得可能。資格よりも実務経験・ポートフォリオが重視されます。"
    },
    "公認会計士": {
      "id": "cpa",
      "annualIncome": "600万円～1500万円以上",
      "jobDetails": "会社のお金が正しく使われているかチェックしたり、経営のアドバイスをする専門家です。社会のルールや法律にもとづいて、会社が健康に成長できるようにサポートします。数字に強く、コツコツと正確に仕事を進めることが得意な人に向いています。",
      "comment": "あなたは公認会計士に向いているかもしれません。数字を扱うのが得意で、社会の仕組みやルールに興味があるなら、大きなやりがいを感じられるでしょう。難しい問題にも粘り強く取り組める真面目さや、社会の役に立ちたいという気持ちが活かせますよ。世の中のお金の流れを支える大切なお仕事です。",
      "traits": [
        "数字やデータに基づく正確な分析が得意",
        "高い倫理観と責任感を持っている",
        "粘り強く、緻密な作業を正確にこなせる",
        "専門知識を深め、社会貢献したいという意欲がある",
        "安定した環境で専門性を追求したい"
      ],
      "requiredSkills": [
        "会計・監査の専門知識",
        "税法・企業法等の法律知識",
        "数値分析・財務分析能力",
        "高いコミュニケーション能力",
        "ITスキル（Excel、会計ソフト等）"
      ],
      "careerPath": [
        "監査法人ジュニアスタッフ（年収500-700万円）",
        "シニアスタッフ・主任（年収700-1000万円）",
        "マネージャー（年収1000-1500万円）",
        "パートナー・独立開業（年収1500万円以上）",
        "企業のCFO・財務責任者（年収1200万円以上）"
      ],
      "workEnvironment": "監査法人、会計事務所、税理士法人、一般企業の経理・財務部門等。繁忙期（3月-5月）は激務となりますが、専門性の高い業務に従事できます。",
      "demandOutlook": "企業のコンプライアンス重視により需要は安定。特にIPO支援・M&A・海外展開サポート等の分野で高い需要があります。",
      "relatedProfessions": ["税理士", "中小企業診断士", "ファイナンシャルプランナー", "経営コンサルタント"],
      "educationRequirements": "公認会計士試験の合格が必須（大学在学中でも受験可能）。合格後2年の実務経験と実務補習所の修了が必要。"
    },
    "建設業": {
      "id": "construction",
      "annualIncome": "350万円～800万円以上",
      "jobDetails": "みんなが使う建物や道路、橋などを作るお仕事です。大きな機械を操作したり、たくさんの人とチームを組んで、計画通りに安全に工事を進めます。「地図に残る仕事」とも言われ、完成した時の達成感は格別です。",
      "comment": "あなたは建設業に向いているかもしれませんね！大きなものを作ったり、チームで協力して何かを成し遂げるのが好きなら、きっと楽しめます。自分の手で街を作り、それがみんなの役に立つことに、大きな喜びを感じられるでしょう。体を動かすことや、仲間と力を合わせるのが得意なあなたにピッタリかもしれません。",
      "traits": [
        "ものづくりが好きで、形に残る仕事に達成感を感じる",
        "チームワークを重視し、協力して目標を達成したい",
        "体を動かすことや現場での作業に抵抗がない",
        "社会貢献への意識が高い",
        "計画性があり、プロジェクト管理に関心がある"
      ],
      "requiredSkills": [
        "基本的な建設技術・安全管理知識",
        "CAD・建設管理ソフトの操作能力",
        "チームリーダーシップ・コミュニケーション能力",
        "品質管理・スケジュール管理能力",
        "関連法規・建築基準法の理解"
      ],
      "careerPath": [
        "現場作業員・技能工（年収250-400万円）",
        "現場監督・職長（年収400-600万円）",
        "工事現場所長・管理責任者（年収600-800万円）",
        "工事部長・支店長（年収800-1200万円）",
        "独立・建設会社経営（年収1000万円以上）"
      ],
      "workEnvironment": "建設現場、工事事務所等。屋外作業が中心で体力が必要。早朝開始・天候による作業中止あり。チームワークが重視される環境。",
      "demandOutlook": "インフラ老朽化対策・災害復旧需要により安定。特に技術者・現場監督は慢性的な人手不足で就職・転職しやすい状況です。",
      "relatedProfessions": ["建築士", "土木技術者", "設備工事業", "不動産デベロッパー"],
      "educationRequirements": "高校卒業以上。建設系専門学校・大学が有利。施工管理技士・建築士等の資格取得でキャリアアップ可能。"
    },
    "デイトレーダー": {
      "id": "day-trader",
      "annualIncome": "実力次第で数百万～数億円以上",
      "jobDetails": "株や外国のお金（為替）などを、短い時間で売ったり買ったりしてお金を増やすことを目指すお仕事です。経済ニュースや会社の情報を分析して、いつ売買するかを素早く判断します。自分の力だけで結果を出す、とてもスリリングな世界です。",
      "comment": "あなたはデイトレーダーに向いているかもしれません。世の中のお金の動きを分析したり、作戦を立ててチャレンジするのが好きなら、ワクワクできるでしょう。プレッシャーに強く、ここぞという時に思い切った判断ができるあなたなら、大きなチャンスを掴めるかもしれません。ただし、リスクも大きいので冷静な判断がいつも必要ですよ。",
      "traits": [
        "市場の動きや数字の分析に強い興味がある",
        "リスクを取って大きなリターンを狙いたい",
        "迅速な判断力と決断力がある",
        "精神的にタフで、プレッシャーに強い",
        "独立独歩で、自分の実力で勝負したい"
      ],
      "requiredSkills": [
        "テクニカル分析・ファンダメンタル分析能力",
        "リスク管理・資金管理能力",
        "経済・企業情報の収集分析能力",
        "取引ツール・チャートソフトの操作スキル",
        "感情コントロール・メンタル管理能力"
      ],
      "careerPath": [
        "小額資金での練習期間（損失覚悟）",
        "安定収益化への学習期間（年収マイナス～100万円）",
        "専業トレーダーとして独立（年収300-1000万円）",
        "大口資金運用・ヘッジファンド設立（年収1000万円以上）",
        "投資教育・コンサルティング事業（年収2000万円以上）"
      ],
      "workEnvironment": "自宅・個人事務所でのパソコン作業が中心。完全に個人の裁量で働く時間を決められるが、市場開始時間に合わせた生活リズムが必要。",
      "demandOutlook": "個人投資家向けツールの充実により参入しやすくなったが、9割以上が損失を出すという現実もあり。長期的に成功するのは極めて困難。",
      "relatedProfessions": ["ファイナンシャルプランナー", "投資アドバイザー", "証券アナリスト", "ファンドマネージャー"],
      "educationRequirements": "特定の学歴・資格は不要。ただし証券外務員資格・FP資格等があると投資知識の証明になる。実践的な投資経験が最重要。"
    },
    "起業家": {
      "id": "entrepreneur",
      "annualIncome": "事業規模・成功次第で青天井",
      "jobDetails": "「こんなものがあったらいいな！」という新しいアイデアで、会社やサービスを自分で作って経営する人です。商品開発からお金の管理、メンバー集めまで、全部自分で考えて行動します。大きな夢を追いかける、とてもやりがいのある挑戦です。",
      "comment": "あなたは起業家に向いているかもしれませんね！「世の中にない新しいものを作りたい！」という強い思いや、みんなを引っ張っていくリーダーシップがあるなら、大きな可能性があります。困難なことにもめげずに、自分のアイデアを形にするために頑張れるあなたは、きっと大きな成功を掴めるでしょう。世界を変えるのは、あなたの一歩から始まるかもしれませんよ。",
      "traits": [
        "新しいアイデアを生み出し、実現したい情熱がある",
        "リスクを恐れず挑戦する精神がある",
        "リーダーシップを発揮し、人を巻き込める",
        "困難な状況でも諦めない行動力と粘り強さがある",
        "自己実現や社会への影響力を強く求める"
      ],
      "requiredSkills": [
        "事業企画・マーケティング戦略立案能力",
        "財務管理・資金調達能力",
        "チームビルディング・人材マネジメント能力",
        "営業・プレゼンテーション能力",
        "問題解決力・危機管理能力"
      ],
      "careerPath": [
        "アイデア検証・事業計画策定期（収入不安定）",
        "起業・事業立ち上げ期（年収0-300万円）",
        "事業拡大・チーム構築期（年収300-1000万円）",
        "事業安定・多角化期（年収1000万円以上）",
        "IPO・M&A・連続起業家（年収数億円以上）"
      ],
      "workEnvironment": "自宅・コワーキングスペース・自社オフィス等。時間・場所の制約が少ない反面、24時間365日事業のことを考える必要がある環境。",
      "demandOutlook": "政府のスタートアップ支援政策により起業環境は改善。ただし成功率は低く、5年後の生存率は約15%という現実もある。",
      "relatedProfessions": ["経営コンサルタント", "ベンチャーキャピタリスト", "事業開発責任者", "フリーランス"],
      "educationRequirements": "特定の学歴は不要だが、MBAや起業スクールでの学習が有効。何より実際のビジネス経験と失敗から学ぶ姿勢が重要。"
    },
    "ワーホリ": {
      "id": "working-holiday",
      "annualIncome": "滞在国・職種により150万円～400万円程度",
      "jobDetails": "海外の国と協定を結び、1年間（またはそれ以上）滞在できる特別なビザ制度です。現地のカフェや農場、ホテルなどで働きながら生活費を稼ぎ、旅行や語学の勉強など、自由に海外生活を体験できます。語学力や国際感覚を養う絶好の機会です。",
      "comment": "あなたはワーキングホリデーという選択肢で、人生が豊かになるかもしれません！知らない世界に飛び込んで、自分の力を試してみたいという冒険心があるなら、最高の経験ができるでしょう。語学を学び、様々な国の人と出会い、日本ではできない経験をすることで、あなたの価値観は大きく広がるはず。この経験が、将来の大きな財産になりますよ。",
      "traits": [
        "異文化への強い好奇心と高い適応力がある",
        "語学習得や国際的な経験に強い価値を感じる",
        "自立心旺盛で、計画的に行動することが得意",
        "新しい環境や予期せぬ出来事を楽しむことができる",
        "固定観念にとらわれず、自分だけのキャリアを築きたい"
      ],
      "requiredSkills": [
        "基礎的な英語コミュニケーション能力",
        "異文化適応力・柔軟性",
        "自立した生活管理能力",
        "積極的なコミュニケーション・社交性",
        "問題解決能力・危機管理能力"
      ],
      "careerPath": [
        "語学学校・準備期間（支出期間）",
        "ワーホリ滞在・現地就労（年収150-400万円相当）",
        "帰国後・経験活用期（外資系・貿易関連等）",
        "国際的キャリア構築（通訳・翻訳・国際営業等）",
        "グローバル企業・海外駐在（年収600万円以上）"
      ],
      "workEnvironment": "カフェ・レストラン・農場・ホテル・ツアーガイド等の現地アルバイト。英語環境での接客・単純作業が中心。住環境はシェアハウスが一般的。",
      "demandOutlook": "コロナ後、ワーホリ制度が順次再開。語学力・国際経験を活かせる職種での需要は高い。ただし帰国後のキャリア設計が重要。",
      "relatedProfessions": ["通訳・翻訳者", "国際営業", "ツアーガイド", "語学講師"],
      "educationRequirements": "高校卒業以上、18-30歳（国により異なる）。語学力の証明は不要だが、TOEIC600点以上あると就職に有利。"
    },
    "インフルエンサー": {
      "id": "influencer",
      "annualIncome": "影響力・案件により数万円～数億円以上",
      "jobDetails": "SNS（インスタグラムやYouTube、TikTokなど）で、自分の好きなことや得意なこと（ファッション、ゲーム、料理など）を発信するお仕事です。たくさんの人に情報や楽しさを届け、影響を与えます。動画を作ったり、ファンと交流したり、時には企業と一緒に商品を宣伝したりもします。",
      "comment": "あなたはインフルエンサーに向いているかもしれません！自分の好きなことや面白いと思ったことを、みんなに広めたい！という気持ちが強いなら、ピッタリです。新しい流行に敏感で、人を楽しませるアイデアを考えるのが得意なあなたは、たくさんのファンを魅了できるでしょう。あなたの発信が、誰かの毎日を楽しくするかもしれませんよ。",
      "traits": [
        "自分の好きなことや得意なことを発信したい",
        "トレンドに敏感で、企画力や表現力がある",
        "多くの人と繋がり、影響力を持ちたい",
        "継続的にコンテンツを作り発信できる",
        "自己プロデュース能力と柔軟な働き方を好む"
      ],
      "requiredSkills": [
        "コンテンツ企画・制作能力",
        "SNS運用・マーケティング知識",
        "写真・動画撮影・編集スキル",
        "コミュニケーション・ファン対応能力",
        "ブランディング・セルフプロデュース能力"
      ],
      "careerPath": [
        "趣味発信・フォロワー獲得期（収益なし）",
        "小規模案件・アフィリエイト（年収数万-50万円）",
        "企業案件・商品PRで収益化（年収100-500万円）",
        "大手企業との継続契約（年収500-2000万円）",
        "自社商品・事業展開（年収1000万円以上）"
      ],
      "workEnvironment": "自宅・スタジオ・撮影場所等で自由に作業。時間の制約は少ないが、トレンドに敏感で継続的な発信が必要。炎上リスクとの隣り合わせ。",
      "demandOutlook": "デジタルマーケティング市場拡大により需要増加。一方で競争激化により差別化が困難。長期的な収益化は一部の成功者のみ。",
      "relatedProfessions": ["YouTuber", "デジタルマーケター", "コンテンツクリエイター", "広報・PR"],
      "educationRequirements": "特定の学歴・資格は不要。ただしマーケティング・メディア学等の知識があると有利。実際のフォロワー数・エンゲージメント率が最重要指標。"
    },
    "難関大進学": {
      "id": "elite-university",
      "annualIncome": "卒業後の進路により500万円～1500万円以上",
      "jobDetails": "将来の夢や目標のために、レベルの高い大学を目指して勉強に打ち込むことです。難しい問題に挑戦したり、得意な科目をさらに深く学んだりします。計画を立ててコツコツ努力することで、自分の可能性を大きく広げることができます。",
      "comment": "あなたは難関大学進学という道で、大きく成長できるかもしれませんね！「もっと知りたい！」という知的好奇心が旺盛で、難しいことにもねばり強く挑戦できるあなたなら、目標を達成できるでしょう。高い目標に向かって計画的に努力できる力は、大学での勉強だけでなく、将来どんな道に進んでもあなたの大きな武器になりますよ。自分の未来を切り開くために、頑張ってください！",
      "traits": [
        "知的好奇心が旺盛で、特定の学問を探求したい",
        "高い目標に向けて計画的に努力を継続できる",
        "論理的思考力や分析力が高い",
        "専門性を高め、将来社会に貢献したいという意識がある",
        "アカデミックな環境での学びに価値を感じる"
      ],
      "requiredSkills": [
        "高度な学習計画策定・実行能力",
        "各科目の深い理解と応用力",
        "論文読解・レポート作成能力",
        "批判的思考・研究能力",
        "プレゼンテーション・ディスカッション能力"
      ],
      "careerPath": [
        "受験勉強・難関大学合格（投資期間）",
        "大学での専門性習得・研究活動（4年間）",
        "大手企業・官公庁・研究機関就職（年収400-600万円）",
        "専門職・管理職へのキャリアアップ（年収700-1200万円）",
        "役員・研究者・起業等（年収1000万円以上）"
      ],
      "workEnvironment": "大手企業・官公庁・研究機関・法律事務所・コンサルティング会社等の知的労働環境。高い専門性と責任が求められる。",
      "demandOutlook": "難関大学出身者への企業からの需要は依然として高い。特に専門性を活かせる職種では学歴が重視される傾向が続いている。",
      "relatedProfessions": ["研究者", "官僚", "弁護士", "医師", "大手企業管理職"],
      "educationRequirements": "難関大学（旧帝大・早慶等）への進学が前提。大学院進学により更なる専門性向上。在学中の成績・研究活動も重要。"
    }
  }
}