{
  "professions": {
    "プログラマー": {
      "annualIncome": "400万円～1000万円以上",
      "jobDetails": "スマホアプリやゲーム、ウェブサイトなどを作るお仕事です。プログラミングという特別な言葉を使ってコンピューターに指示を出し、みんなが使う便利なシステムや楽しいサービスを生み出します。新しい技術をどんどん学ぶことも大切ですよ。",
      "comment": "あなたはプログラマーに向いているかもしれませんね！パズルを解くみたいに仕組みを考えたり、新しい技術にワクワクしたりするなら、ピッタリです。自分のアイデアを形にして、みんなを驚かせるようなものを作ることに、きっと大きなやりがいを感じるでしょう。まずは簡単なプログラミングから挑戦してみるのも面白いですよ。",
      "traits": [
        "論理的思考が得意で、パズルを解くように問題解決が好き",
        "新しい技術や情報に常にアンテナを張っている",
        "ものづくりや創造的な作業に喜びを感じる",
        "集中して一つの作業に没頭できる",
        "自分のスキルで具体的な成果を出したい"
      ]
    },
    "公認会計士": {
      "annualIncome": "600万円～1500万円以上",
      "jobDetails": "会社のお金が正しく使われているかチェックしたり、経営のアドバイスをする専門家です。社会のルールや法律にもとづいて、会社が健康に成長できるようにサポートします。数字に強く、コツコツと正確に仕事を進めることが得意な人に向いています。",
      "comment": "あなたは公認会計士に向いているかもしれません。数字を扱うのが得意で、社会の仕組みやルールに興味があるなら、大きなやりがいを感じられるでしょう。難しい問題にも粘り強く取り組める真面目さや、社会の役に立ちたいという気持ちが活かせますよ。世の中のお金の流れを支える大切なお仕事です。",
      "traits": [
        "数字やデータに基づく正確な分析が得意",
        "高い倫理観と責任感を持っている",
        "粘り強く、緻密な作業を正確にこなせる",
        "専門知識を深め、社会貢献したいという意欲がある",
        "安定した環境で専門性を追求したい"
      ]
    },
    "建設業": {
      "annualIncome": "350万円～800万円以上",
      "jobDetails": "みんなが使う建物や道路、橋などを作るお仕事です。大きな機械を操作したり、たくさんの人とチームを組んで、計画通りに安全に工事を進めます。「地図に残る仕事」とも言われ、完成した時の達成感は格別です。",
      "comment": "あなたは建設業に向いているかもしれませんね！大きなものを作ったり、チームで協力して何かを成し遂げるのが好きなら、きっと楽しめます。自分の手で街を作り、それがみんなの役に立つことに、大きな喜びを感じられるでしょう。体を動かすことや、仲間と力を合わせるのが得意なあなたにピッタリかもしれません。",
      "traits": [
        "ものづくりが好きで、形に残る仕事に達成感を感じる",
        "チームワークを重視し、協力して目標を達成したい",
        "体を動かすことや現場での作業に抵抗がない",
        "社会貢献への意識が高い",
        "計画性があり、プロジェクト管理に関心がある"
      ]
    },
    "デイトレーダー": {
      "annualIncome": "実力次第で数百万～数億円以上",
      "jobDetails": "株や外国のお金（為替）などを、短い時間で売ったり買ったりしてお金を増やすことを目指すお仕事です。経済ニュースや会社の情報を分析して、いつ売買するかを素早く判断します。自分の力だけで結果を出す、とてもスリリングな世界です。",
      "comment": "あなたはデイトレーダーに向いているかもしれません。世の中のお金の動きを分析したり、作戦を立ててチャレンジするのが好きなら、ワクワクできるでしょう。プレッシャーに強く、ここぞという時に思い切った判断ができるあなたなら、大きなチャンスを掴めるかもしれません。ただし、リスクも大きいので冷静な判断がいつも必要ですよ。",
      "traits": [
        "市場の動きや数字の分析に強い興味がある",
        "リスクを取って大きなリターンを狙いたい",
        "迅速な判断力と決断力がある",
        "精神的にタフで、プレッシャーに強い",
        "独立独歩で、自分の実力で勝負したい"
      ]
    },
    "起業家": {
      "annualIncome": "事業規模・成功次第で青天井",
      "jobDetails": "「こんなものがあったらいいな！」という新しいアイデアで、会社やサービスを自分で作って経営する人です。商品開発からお金の管理、メンバー集めまで、全部自分で考えて行動します。大きな夢を追いかける、とてもやりがいのある挑戦です。",
      "comment": "あなたは起業家に向いているかもしれませんね！「世の中にない新しいものを作りたい！」という強い思いや、みんなを引っ張っていくリーダーシップがあるなら、大きな可能性があります。困難なことにもめげずに、自分のアイデアを形にするために頑張れるあなたは、きっと大きな成功を掴めるでしょう。世界を変えるのは、あなたの一歩から始まるかもしれませんよ。",
      "traits": [
        "新しいアイデアを生み出し、実現したい情熱がある",
        "リスクを恐れず挑戦する精神がある",
        "リーダーシップを発揮し、人を巻き込める",
        "困難な状況でも諦めない行動力と粘り強さがある",
        "自己実現や社会への影響力を強く求める"
      ]
    },
    "ホスト": {
      "annualIncome": "実力・人気次第で数百万～数千万円以上",
      "jobDetails": "主にお客様（主に女性）と楽しくおしゃべりをしたり、お酒を一緒に飲んだりして、特別な時間を提供するお仕事です。相手を喜ばせる会話術や、場の雰囲気を盛り上げるエンターテイナーとしての才能が求められます。人気や頑張りが収入に直結する、実力の世界です。",
      "comment": "あなたはホストに向いているかもしれません。人と話すのが大好きで、相手を楽しませることに喜びを感じるなら、才能を発揮できるでしょう。華やかな世界で自分を磨き、たくさんの人を笑顔にしたいという気持ちがあれば、人気者になれる可能性も。あなたの個性とトークで、特別な時間を作り出してみませんか。",
      "traits": [
        "人と話すのが好きで、コミュニケーション能力が高い",
        "相手を楽しませることに喜びを感じる",
        "華やかな世界や人脈形成に興味がある",
        "実力主義で高収入を目指したい意欲がある",
        "自己プロデュース能力があり、自分を磨き続けられる"
      ]
    },
    "キャバ嬢": {
      "annualIncome": "実力・人気次第で数百万～数千万円以上",
      "jobDetails": "主にお客様（主に男性）と楽しく会話をしたり、細やかな気配りでおもてなしをして、くつろいだ時間を提供するお仕事です。聞き上手であることや、相手に合わせた話題選び、明るい笑顔などが大切です。頑張りや人気が収入につながる、実力が試されるお仕事です。",
      "comment": "あなたはキャバ嬢に向いているかもしれませんね。人の話を聞くのが上手で、相手に合わせた会話で楽しませるのが得意なら、きっと活躍できますよ。華やかな雰囲気の中で、自分の魅力を活かしてたくさんの人を元気づけたい、そして頑張った分だけ評価されたいというあなたにピッタリかもしれません。",
      "traits": [
        "高いコミュニケーション能力と聞き上手な一面がある",
        "細やかな気配りができ、相手を心地よくさせられる",
        "華やかな環境で、自分を魅力的に見せたい",
        "成果に応じて高収入を得たいという目標がある",
        "精神的にタフで、人間観察力がある"
      ]
    },
    "インフルエンサー": {
      "annualIncome": "影響力・案件により数万円～数億円以上",
      "jobDetails": "SNS（インスタグラムやYouTube、TikTokなど）で、自分の好きなことや得意なこと（ファッション、ゲーム、料理など）を発信するお仕事です。たくさんの人に情報や楽しさを届け、影響を与えます。動画を作ったり、ファンと交流したり、時には企業と一緒に商品を宣伝したりもします。",
      "comment": "あなたはインフルエンサーに向いているかもしれません！自分の好きなことや面白いと思ったことを、みんなに広めたい！という気持ちが強いなら、ピッタリです。新しい流行に敏感で、人を楽しませるアイデアを考えるのが得意なあなたは、たくさんのファンを魅了できるでしょう。あなたの発信が、誰かの毎日を楽しくするかもしれませんよ。",
      "traits": [
        "自分の好きなことや得意なことを発信したい",
        "トレンドに敏感で、企画力や表現力がある",
        "多くの人と繋がり、影響力を持ちたい",
        "継続的にコンテンツを作り発信できる",
        "自己プロデュース能力と柔軟な働き方を好む"
      ]
    },
    "難関大進学": {
      "annualIncome": "卒業後の進路により500万円～1500万円以上",
      "jobDetails": "将来の夢や目標のために、レベルの高い大学を目指して勉強に打ち込むことです。難しい問題に挑戦したり、得意な科目をさらに深く学んだりします。計画を立ててコツコツ努力することで、自分の可能性を大きく広げることができます。",
      "comment": "あなたは難関大学進学という道で、大きく成長できるかもしれませんね！「もっと知りたい！」という知的好奇心が旺盛で、難しいことにもねばり強く挑戦できるあなたなら、目標を達成できるでしょう。高い目標に向かって計画的に努力できる力は、大学での勉強だけでなく、将来どんな道に進んでもあなたの大きな武器になりますよ。自分の未来を切り開くために、頑張ってください！",
      "traits": [
        "知的好奇心が旺盛で、特定の学問を探求したい",
        "高い目標に向けて計画的に努力を継続できる",
        "論理的思考力や分析力が高い",
        "専門性を高め、将来社会に貢献したいという意識がある",
        "アカデミックな環境での学びに価値を感じる"
      ]
    }
  }
}